#  3:
        # Напишите программу, которая измеряет длину введенной строки. 
        # Если строка длиннее десяти символов, то выносится предупреждение. 
        # Если короче, то к строке добавляется столько символов *, чтобы
        #  ее длина составляла десять символов, после чего новая строка должна 
        # выводиться на экран.
###################################################################

data = 'hello my friend'

print(len(data))

for data in range(1, 20):
    print(data)

# while data == 10:
#     print('good')

# for i in data:
#     if i > 10 :
#         print('warnings')
#     elif i < 10:
#         print('enter', + 10 )
# else:
#     print('nothing')

